src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    innerAMI
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }

    outerAMI
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    farFieldWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sphere
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
